---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextBoxVisibility
source: html/77f23d33-acd6-b2a8-03b0-fba7e65e36a8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextBoxVisibility Property

"Show Border"

## Syntax (C#)
```csharp
public static ForgeTypeId TextBoxVisibility { get; }
```